# Group by statements in pandas

In [2]:
import pandas as pd
import numpy as np

df = pd.DataFrame([{'Name': 'Chris', 'Item Purchased': 'Sponge', 'Cost': 22.50, 'Quantity': 0, 'Weight': 1},
                   {'Name': 'Kevyn', 'Item Purchased': 'Kitty Litter', 'Cost': 2.50, 'Quantity': 1, 'Weight': 1},
                   {'Name': 'Filip', 'Item Purchased': 'Spoon', 'Cost': 5.00, 'Quantity': 2, 'Weight': 1}],
                  index=['1', '2', '3'])
df

   Cost Item Purchased   Name  Quantity  Weight
1  22.5         Sponge  Chris         0       1
2   2.5   Kitty Litter  Kevyn         1       1
3   5.0          Spoon  Filip         2       1

In [13]:
df['category'] = ['backpacks', 'apparel', 'apparel']

In [14]:
df

   Cost Item Purchased   Name  Quantity  Weight  total weight   category
1  22.5         Sponge  Chris         0       1             0  backpacks
2   2.5   Kitty Litter  Kevyn         1       1             1    apparel
3   5.0          Spoon  Filip         2       1             2    apparel

In [21]:
# Looking at our backpacking equipment DataFrame, 
# suppose we are interested in finding our total 
# weight for each category. Use groupby to group 
# the dataframe, and apply a function to calculate 
# the total weight (Weight x Quantity) by category.

print(df.groupby('category').apply(lambda df,a,b: sum(df[a] * df[b]), 'Weight', 'Quantity'))


# Or alternatively without using a lambda:
# def totalweight(df, w, q):
#        return sum(df[w] * df[q])
#        
# print(df.groupby('Category').apply(totalweight, 'Weight (oz.)', 'Quantity'))

category
apparel      3
backpacks    0
dtype: int64

In [22]:
df

   Cost Item Purchased   Name  Quantity  Weight  total weight   category
1  22.5         Sponge  Chris         0       1             0  backpacks
2   2.5   Kitty Litter  Kevyn         1       1             1    apparel
3   5.0          Spoon  Filip         2       1             2    apparel

In [33]:
df.groupby('category').agg({'Quantity': np.average})

           Quantity
category
apparel         1.5
backpacks       0.0

# Scales

In [5]:
#Try casting this series to categorical with the ordering Low < Medium < High.

s = pd.Series(['Low', 'Low', 'High', 'Medium', 'Low', 'High', 'Low'])

# Your code here
s.astype('category', ordered=True, categories=['Low', 'Medium', 'High'])

0       Low
1       Low
2      High
3    Medium
4       Low
5      High
6       Low
dtype: category
Categories (3, object): [Low < Medium < High]

In [6]:
#Suppose we have a series that holds height data for jacket wearers. Use pd.cut to bin this data into 3 bins.

s = pd.Series([168, 180, 174, 190, 170, 185, 179, 181, 175, 169, 182, 177, 180, 171])

# Your code here
pd.cut(s, 3)

0     (167.978, 175.333]
1     (175.333, 182.667]
2     (167.978, 175.333]
3       (182.667, 190.0]
4     (167.978, 175.333]
5       (182.667, 190.0]
6     (175.333, 182.667]
7     (175.333, 182.667]
8     (167.978, 175.333]
9     (167.978, 175.333]
10    (175.333, 182.667]
11    (175.333, 182.667]
12    (175.333, 182.667]
13    (167.978, 175.333]
dtype: category
Categories (3, interval[float64]): [(167.978, 175.333] < (175.333, 182.667] < (182.667, 190.0]]